## creating a pandas dataframe

pandas dataframe is a powerfull tool that allows us to store and manipulate data in a structured way ,similar to an excel spread sheet or a SQL table .A dataframe issimilar to a table with rows and columns.

## creating an empty dataframe 

An empty dataframe in pandas is a table with no data but can have defined column name and indexes .it is usefull for setting up   a structure before calling a framework

In [1]:
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
# creating a dataframe with list 
# each item in the list becomes a row
#the datafraame consist of the single unnamed columns
import pandas as pd
lst=["geeks","for","geeks","is","portal","for","geeks"]
df=pd.DataFrame(lst)
print(df)

        0
0   geeks
1     for
2   geeks
3      is
4  portal
5     for
6   geeks

In [4]:
# creating dataframe from dict of numpy array
import numpy as np
import pandas as pd

data=np.array([[1,2,3],[4,5,6],[7,8,9]])
df=pd.DataFrame(data,columns=["A","B","C"])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

### creating a dataframe from list of dictonaries
it is useful when working with API and JSON files

In [8]:
import pandas as pd
dict={"name":["aparna","Pankaj","sudhir","geeku"],
      "degree":["MBA","MCA","M.Tech","B.Tech"],
      "score":[90,40,80,70]}
df=pd.DataFrame(dict)
print(df)

     name  degree  score
0  aparna     MBA     90
1  Pankaj     MCA     40
2  sudhir  M.Tech     80
3   geeku  B.Tech     70

## pandas dataframe index

In [1]:
import pandas as pd
data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df=pd.DataFrame(data)
print(df)
print(df.index)

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000
RangeIndex(start=0, stop=5, step=1)

In [11]:
#setting index

set_custom_index=df.set_index("Name")
print(set_custom_index)

         Age  Gender  Salary
Name
John      25    Male   50000
Alice     30  Female   55000
Bob       22    Male   40000
Eve       35  Female   70000
Charlie   28    Male   48000

In [12]:
set_cus=df.set_index("Age")
print(set_cus)

        Name  Gender  Salary
Age
25      John    Male   50000
30     Alice  Female   55000
22       Bob    Male   40000
35       Eve  Female   70000
28   Charlie    Male   48000

In [13]:
# resetting the index 
#  if you want reset the index back to default integer index use reset_index() method
# this will convert the current index into regular column and create a new default index

In [14]:
df_reset=df.reset_index()
print(df_reset)

   index     Name  Age  Gender  Salary
0      0     John   25    Male   50000
1      1    Alice   30  Female   55000
2      2      Bob   22    Male   40000
3      3      Eve   35  Female   70000
4      4  Charlie   28    Male   48000

# indexing with loc 

the loc[] method in pandas allows to access rowsa and columns of a dataframe using labels ,making it easy retrieve specific data points

In [18]:
# loc is used when first column of a row
row=df.loc[0]
print(row)

Name       John
Age          25
Gender     Male
Salary    50000
Name: 0, dtype: object

### highlights
df.index



df.set_index()



df.reset_index()



df.loc["alice"]

In [19]:
## pandas access dataframe

## accessing columns from dataframe

In [20]:
age_column=df["Age"]
print(age_column)

0    25
1    30
2    22
3    35
4    28
Name: Age, dtype: int64

In [21]:
# accessing rows by index
second_row=df.iloc[1]
print(second_row)

Name       Alice
Age           30
Gender    Female
Salary     55000
Name: 1, dtype: object

In [22]:
#accessing rows by index
second_row=df.iloc[1]
print(second_row)

Name       Alice
Age           30
Gender    Female
Salary     55000
Name: 1, dtype: object

In [23]:
first_row=df.iloc[0]
print(first_row)

Name       John
Age          25
Gender     Male
Salary    50000
Name: 0, dtype: object

In [24]:
subset=df.loc[0:2,["Name","Age"]]
print(subset)

    Name  Age
0   John   25
1  Alice   30
2    Bob   22

In [25]:
# accessing rows based on condition
filtered_data=df[df["Age"]>25]
print(filtered_data)

      Name  Age  Gender  Salary
1    Alice   30  Female   55000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [27]:
# accesiing a data based on the at and iat[]

salary_at_index_2=df.at[2,"Salary"]
print(salary_at_index_2)

40000

In [28]:
age=df.at[4,"Age"]
print(age)

28

In [29]:
# indexing and selecting data with pandas 
# indexing and selecting data helps us to retrieve specific rows,columns or 
#subsets of the dat drom a dataframe.

In [30]:
# indexing data using [] operator

In [31]:
# selecting a single column

In [33]:
print(df.head(2))

    Name  Age  Gender  Salary
0   John   25    Male   50000
1  Alice   30  Female   55000

In [34]:
display(df.head(2))

    Name  Age  Gender  Salary
0   John   25    Male   50000
1  Alice   30  Female   55000

In [35]:
first=df["Age"]
display(first.head(2))

0    25
1    30
Name: Age, dtype: int64

In [43]:
# selecting a multiple columns
first=data[['Age','Name','Salary']]
display(first.head(3))

TypeError: unhashable type: 'list'

In [6]:
row=data.loc[0]
print(row)

AttributeError: 'dict' object has no attribute 'loc'

In [3]:
import pandas as pd
data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df=pd.DataFrame(data)
print(df)
print(df.index)

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000
RangeIndex(start=0, stop=5, step=1)

In [5]:
import pandas as pd

In [7]:
#working with crime data

In [8]:
data=pd.read_csv("crime.csv")
print("Dataset")
display(data.head(5))

Dataset

,STATE/UT,DISTRICT,YEAR,MURDER,ATTEMPT TO MURDER,CULPABLE HOMICIDE NOT AMOUNTING TO MURDER,RAPE,CUSTODIAL RAPE,OTHER RAPE,KIDNAPPING & ABDUCTION,...,ARSON,HURT/GREVIOUS HURT,DOWRY DEATHS,ASSAULT ON WOMEN WITH INTENT TO OUTRAGE HER MODESTY,INSULT TO MODESTY OF WOMEN,CRUELTY BY HUSBAND OR HIS RELATIVES,IMPORTATION OF GIRLS FROM FOREIGN COUNTRIES,CAUSING DEATH BY NEGLIGENCE,OTHER IPC CRIMES,TOTAL IPC CRIMES
0,Andhra Pradesh,ADILABAD,2013,96,72,13,61,0,61,65,...,30,2394,12,197,138,464,0,376,1390,6381
1,Andhra Pradesh,ANANTAPUR,2013,156,149,3,28,0,28,110,...,29,2537,23,337,43,161,0,573,1634,6913
2,Andhra Pradesh,CHITTOOR,2013,72,61,2,31,0,31,52,...,18,937,13,119,84,435,0,546,2239,5610
3,Andhra Pradesh,CUDDAPAH,2013,93,107,7,19,0,19,84,...,34,2310,9,318,163,207,0,464,1741,7048
4,Andhra Pradesh,CYBERABAD,2013,162,123,16,138,0,138,192,...,40,4284,43,350,338,1526,0,1104,3139,19992

In [9]:
state=data["STATE/UT"]
display(state.head(5))

0    Andhra Pradesh
1    Andhra Pradesh
2    Andhra Pradesh
3    Andhra Pradesh
4    Andhra Pradesh
Name: STATE/UT, dtype: object

In [11]:
columns=data["STATE/UT","DISTRICT",YEAR]
display(columns.head(5))

NameError: name 'YEAR' is not defined

In [12]:
row=data.loc["Andhra Pradesh"]
print(row)

KeyError: 'Andhra Pradesh'

In [31]:
# creating pandas datraframe 


# create custom dataframe 

player_list = [['M.S.Dhoni', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kohli', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000],
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]
df=pd.DataFrame(player_list,columns=["Name","Age","Weight","Salery"])
               
print(df)

            Name  Age  Weight   Salery
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [32]:
# slicing using iloc[] methos

In [33]:
#slicing a rows from dataframe
sliced_rows=df.iloc[0:3]
print(sliced_rows)

            Name  Age  Weight   Salery
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000

In [34]:
# slicing column in dataframe
sliced_col=df.iloc[:,0:2]
print(sliced_col)

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38
2        V.Kohli   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Peterson   42

In [35]:
# selecting a specified cell in a table
value=df.iloc[0,0]
print(value)

M.S.Dhoni

In [36]:
# selecting a table with a condition 
condition=df[df["Age"]>40].iloc[:,:]
print(condition)

         Name  Age  Weight   Salery
6  K.Peterson   42      85  2528000

In [37]:
custom = df.loc['A.B.D Villers':'S.Smith']
print(custom)

Empty DataFrame
Columns: [Name, Age, Weight, Salery]
Index: []

In [38]:
df.set_index('Name', inplace=True)

custom = df.loc['A.B.D Villers':'S.Smith']
print(custom)

               Age  Weight   Salery
Name
A.B.D Villers   38      74  3428000
V.Kohli         31      70  8428000
S.Smith         34      80  4428000

In [39]:
df.set_index('Name',inplace=True)
custom=df.loc["A.B.D Villers":"S.Smith"]
print(custom)

KeyError: "None of ['Name'] are in the columns"

In [40]:
df.set_index('Name', inplace=True)

custom = df.loc['A.B.D Villers':'S.Smith']
print(custom)

KeyError: "None of ['Name'] are in the columns"

In [41]:
# import module
import pandas as pd

# assign data
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

# display dataframe
display(dataFrame)

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

In [42]:
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

# filter dataframe 

display(dataFrame.loc[(dataFrame["Salary"]>=100000)&(dataFrame["Age"]<40)&(dataFrame["JOB"].str.startswith("D")),
        ["Name","JOB"]])

        Name       JOB
0   RACHEL    DESIGNER

Here will get all rows having Salary greater or equal to 100000 and Age < 40 and their JOB starts with â€˜Dâ€™ from the data frame. We need to use NumPy.

In [46]:
import numpy as np
filtered_data=np.where((dataFrame["Salary"]>=100000)&(dataFrame["Age"]<40)&
                       (dataFrame["JOB"].str.startswith("D")))

In [47]:
print(filtered_data)

(array([0], dtype=int64),)

In [49]:
display(dataFrame.loc[filtered_data])

        Name  Age  Salary       JOB
0   RACHEL     30  100000  DESIGNER

Filter Pandas Dataframe Using Query (eval and query works only with columns)
In this approach, we get all rows having Salary lesser or equal to 100000 and Age < 40, and their JOB starts with â€˜Câ€™ from the dataframe. Its just query the columns of a DataFrame with a single or more Boolean expressions and if multiple, it is having & condition in the middle.

In [51]:
display(dataFrame.query('Salary <=100000 & Age<40 & JOB.str.startswith("C").values'))

        Name  Age  Salary   JOB
1   MONICA     35   93000  CHEF

In [53]:
# pandas boolean indecing multiple conditiuon standard way

In [55]:

# filter dataframe 
display(dataFrame[(dataFrame['Salary']>=100000) & (dataFrame['Age']<40) 
        & dataFrame['JOB'].str.startswith('P')][['Name','Age','Salary']])

         Name  Age  Salary
3    ROSS       33  120000

In [56]:
# different ways of creating a dataframe

In [57]:
import pandas as pd
data={"Name":["Tom","nick","Krish","jack"],
      "Age":[20,21,19,18]}
df=pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  Krish   19
3   jack   18

In [58]:
# pandas dataframe syntax
# pandas.DataFrame(data,index,columns)

creating a dataframe from list or arrays

In [59]:
data=[["tom",10],["alice",18],["dan",14]]
df=pd.DataFrame(data,columns=["Name","Age"])
print(df)

    Name  Age
0    tom   10
1  alice   18
2    dan   14

In [61]:

data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']}


df=pd.DataFrame(data1,index=[0,1,2,3])
df1=pd.DataFrame(data1,index=[4,5,6,7])
print(df,"\n\n",df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4     Jai   27     Nagpur           Msc
5  Princi   24     Kanpur            MA
6  Gaurav   22  Allahabad           MCA
7    Anuj   32    Kannuaj           Phd

In [62]:
# concatination
frames=[df,df1]
res1=pd.concat(frames)
print(res1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4     Jai   27     Nagpur           Msc
5  Princi   24     Kanpur            MA
6  Gaurav   22  Allahabad           MCA
7    Anuj   32    Kannuaj           Phd

In [64]:
res2=pd.concat([df,df1],axis=1,sort=False)
res2

,Name,Age,Address,Qualification,Name,Age,Address,Qualification
0,Jai,27.0,Nagpur,Msc,NaN,NaN,NaN,NaN
1,Princi,24.0,Kanpur,MA,NaN,NaN,NaN,NaN
2,Gaurav,22.0,Allahabad,MCA,NaN,NaN,NaN,NaN
3,Anuj,32.0,Kannuaj,Phd,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,Jai,27.0,Nagpur,Msc
5,NaN,NaN,NaN,NaN,Princi,24.0,Kanpur,MA
6,NaN,NaN,NaN,NaN,Gaurav,22.0,Allahabad,MCA
7,NaN,NaN,NaN,NaN,Anuj,32.0,Kannuaj,Phd

In [65]:
# sorting pandas dataframe

sorting data is done by using sort_values() method


Parameters of sort_values() method

by : specifies the cilumn to sort by 

ascending : A Boolean ( True for acending ) and false for descending 


inplace  : id True ,the original dataframe is modified otherwise a new sorted DatFrame is returned

na_position : control where Nan vakues are placed if we use 'first' to put NaNs at top or 'last'(default)to place them at end

ignore_index :

In [66]:
# sorting a adataframe by a single column

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}

df=pd.DataFrame(data)
sorted_df=df.sort_values(by="Age")
print(sorted_df)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [67]:
# sorting an array using ascending 
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],'Score': [85, 90, 95, 80]}


df=pd.DataFrame(data)
sorted_df=df.sort_values(by="Age",ascending=False)
print(sorted_df)

      Name  Age  Score
3    David   40     80
2  Charlie   35     95
1      Bob   30     90
0    Alice   25     85

In [68]:
# sorting a values by a multiple columns
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}

df=pd.DataFrame(data)
print(sorted_df)

      Name  Age  Score
3    David   40     80
2  Charlie   35     95
1      Bob   30     90
0    Alice   25     85

In [69]:
data_with_nan = {"Name": ["Alice", "Bob", "Charlie", "David"],
                 "Age": [28, 22, None, 22]}
df_nan=pd.DataFrame(data_with_nan)
sorted_df=df_nan.sort_values(by="Age",na_position="first")
print(sorted_df)

      Name   Age
2  Charlie   NaN
1      Bob  22.0
3    David  22.0
0    Alice  28.0

### sorting by array
in sorting by column values we may also want to sort a dataFrame based on its index .This can be done using the sort_index() method

In [70]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}

df=pd.DataFrame(data)
df_sorted_by_index=df.sort_index()
print(df_sorted_by_index)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [71]:
df_sorted_by_desc=df.sort_index(ascending=False)
print(df_sorted_by_desc)

      Name  Age  Score
3    David   40     80
2  Charlie   35     95
1      Bob   30     90
0    Alice   25     85

In [72]:
df = pd.DataFrame({'Product': ['Carrots', 'Broccoli', 'Banana', 'Banana',
                               'Beans', 'Orange', 'Broccoli', 'Banana'],
                   'Category': ['Vegetable', 'Vegetable', 'Fruit', 'Fruit',
                                'Vegetable', 'Fruit', 'Vegetable', 'Fruit'],
                   'Quantity': [8, 5, 3, 4, 5, 9, 11, 8],
                   'Amount': [270, 239, 617, 384, 626, 610, 62, 90]})

In [73]:
df

    Product   Category  Quantity  Amount
0   Carrots  Vegetable         8     270
1  Broccoli  Vegetable         5     239
2    Banana      Fruit         3     617
3    Banana      Fruit         4     384
4     Beans  Vegetable         5     626
5    Orange      Fruit         9     610
6  Broccoli  Vegetable        11      62
7    Banana      Fruit         8      90

In [74]:
# getting total sales of eaxch product

In [76]:
pivot=df.pivot_table(index=["Product"],values=["Amount"],aggfunc="sum")
print(pivot)

          Amount
Product
Banana      1091
Beans        626
Broccoli     301
Carrots      270
Orange       610

In [77]:
# getting total sales of each category

In [78]:
pivot=df.pivot_table(index=["Category"],values=["Amount"],aggfunc="sum")
print(pivot)

           Amount
Category
Fruit        1701
Vegetable    1197

In [81]:
# getting pivot values by category and product
pivot=df.pivot_table(index=["Product","Category"],
                  values=["Amount"],aggfunc="sum")
print(pivot)

                    Amount
Product  Category
Banana   Fruit        1091
Beans    Vegetable     626
Broccoli Vegetable     301
Carrots  Vegetable     270
Orange   Fruit         610

In [82]:
# Getting the mean,median and mode sales by category

In [83]:
pivot=df.pivot_table(index=["Category"],values=["Amount"],aggfunc={"median","mean","min"})
print(pivot)

           Amount
             mean median min
Category
Fruit      425.25  497.0  90
Vegetable  299.25  254.5  62

In [84]:
# get mean,median,minimum sale by product

In [86]:
pivot=df.pivot_table(index=["Product"],values=["Amount"],aggfunc={"median","mean","min"})
print(pivot)

              Amount
                mean median  min
Product
Banana    363.666667  384.0   90
Beans     626.000000  626.0  626
Broccoli  150.500000  150.5   62
Carrots   270.000000  270.0  270
Orange    610.000000  610.0  610

In [87]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}

In [88]:
df=pd.DataFrame(data)
sorted_df=df.sort_values(by="Age")
print(sorted_df)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [89]:
# sort the array by aage with descending order
sorted_array=df.sort_values(by="Age",ascending=False)
print(sorted_array)

      Name  Age  Score
3    David   40     80
2  Charlie   35     95
1      Bob   30     90
0    Alice   25     85

In [90]:
# sorting the dataframe by multiple columns
df=pd.DataFrame(data)

In [93]:
sorted_array=df.sort_values(by=["Age","Score"])
print(sorted_array)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [94]:
sorted_df=df.sort_values(by="Age",na_position="first")
print(sorted_df)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [95]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}

df=pd.DataFrame(data)

In [96]:
df_sorted=df.sort_index()
print(df_sorted)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [97]:
sort_index_desc=df.sort_index(ascending=False)
print(sort_index_desc)

      Name  Age  Score
3    David   40     80
2  Charlie   35     95
1      Bob   30     90
0    Alice   25     85

In [98]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [28, 22, 25, 22, 28],
    "Score": [85, 90, 95, 80, 88]
}

df=pd.DataFrame(data)
sorted_df=df.sort_values(by="Age",kind="quicksort")
print(sorted_df)

      Name  Age  Score
1      Bob   22     90
3    David   22     80
2  Charlie   25     95
0    Alice   28     85
4      Eve   28     88

In [99]:
merged_df=df.sort_values(by="Age",kind="mergesort")
print(merged_df)

      Name  Age  Score
1      Bob   22     90
3    David   22     80
2  Charlie   25     95
0    Alice   28     85
4      Eve   28     88

In [100]:
heap_sort=df.sort_values(by="Age",kind="heapsort")
print(heap_sort)

      Name  Age  Score
1      Bob   22     90
3    David   22     80
2  Charlie   25     95
4      Eve   28     88
0    Alice   28     85

In [101]:
# pandas merging,joining and concatinating

In [ ]:
# when we are working with data organized in rows and columns